Repository: yoavmatchulsky/servula-wp
Catalog: languages/*.po
Languages: he_il

source: Learn About Us
he_il: אודות

source: What we do?
he_il: איך זה עובד?

source: Our Values
he_il: הערכים שלנו

source: FAQ
he_il: שאלות נפוצות

source: What is Inbound Marketing?
he_il: מה זה Inbound Marketing?

source: Jobs
he_il: דרושים

source: Contact Us
he_il: צור קשר

source: Blog
he_il: בלוג

source: General
he_il: כללי

source: Our Services
he_il: השירותים שלנו

source: Register Now!
he_il: הירשם כעת!

source: Terms of Service
he_il: תנאי שירות

source: Spread the word!
he_il: הפץ את השמועה!

source: <strong>Hey! Get over here.</strong> Sign up for Servula's newsletter and get updates about our latest activities, blog posts, special offers and cool tips!
he_il: <strong>אהלן! יש לנו משהו מעניין בשבילך.</strong> הרשם לניוזלטר של Servula וקבל עדכונים על הפעילות שלנו, מדריכים מקצועיים, הצעות מיוחדות וטיפים לקידום האתר.

source: Sign Up
he_il: הרשם לניוזלטר

source: Name
he_il: שם

source: Email
he_il: אימייל

source: All right reserved.
he_il: כל הזכויות שמורות.

source: Servula is currently in Beta
he_il: Servula - שירותים למקדמי אתרים

source: Buy Credits %s
he_il: קנה קרדיטים %s

source: Order Services %s
he_il: הזמן שירותים %s

source: Dashboard
he_il: עמוד חשבון

source: Account Settings
he_il: הגדרות

source: Buy Credits
he_il: קנה קרדיטים

source: (%s left)
he_il: (נותרו %s)

source: Logout
he_il: התנתק

source: Login/Register
he_il: התחבר/הירשם

source: Email:
he_il: אימייל:

source: Forgot Password?
he_il: שכחת סיסמא?

source: Password:
he_il: סיסמא:

source: Remember Me
he_il: זכור אותי

source: Login
he_il: התחבר

source: Or
he_il: או

source: Register now
he_il: הירשם כעת

source: Start Now
he_il: התחל כעת

source: No Credits, Yet
he_il: אין עדיין קרדיטים

source: <strong>%d</strong> Credits Left
he_il: נותרו לך <strong>%d</strong> קרדיטים

source: <strong>%d</strong> Service in Cart
he_il: <strong>%d</strong> שירותים בעגלה

source: Cart is Empty
he_il: העגלה ריקה

source: Description &amp; Examples
he_il: הסבר ודוגמאות

source: Sources
he_il: מקורות

source: Back to Services page
he_il: חזרה לעמוד השירותים

source: Related Services:
he_il: שירותים קשורים:

source: More Services &raquo;
he_il: שירותים נוספים &raquo;

source: No Responses
he_il: אין תגובות

source: One Response
he_il: תגובה אחת

source: % Responses
he_il: % תגובות

source: Comments are closed.
he_il: אין אפשרות להשאיר תגובות.

source: Leave a Reply
he_il: השאר תגובה

source: Leave a Reply to %s
he_il: השאר תגובה ל- %s

source: You must be <a href="%s">logged in</a> to post a comment.
he_il: אתה חייב להיות <a href="%s">מחובר</a> כדי להשאיר תגובה.

source: Logged in as <a href="%s/wp-admin/profile.php">%s</a>.
he_il: מחובר כ<a href="%s/wp-admin/profile.php">%s</a>.

source: <a href="%s" title="Log out of this account">Log out &raquo;</a>
he_il: <a href="%s" title="התנתק מחשבון זה">התנתק &raquo;</a>

source: (required)
he_il: (חובה)

source: Email (will not be published)
he_il: אי-מייל (לא יפורסם)

source: Website
he_il: אתר

source: Submit Comment
he_il: השאר תגובה

source: By:
he_il: מאת:

source: Published in:
he_il: פורסם בקטגוריה:

source: Tags:
he_il: תגיות:

source: Not Found
he_il: העמוד לא נמצא

source: Sorry, but you are looking for something that isn't here.
he_il: אנו מצטערים, אבל העמוד שחיפשת פשוט לא פה.

source: Google+ Profile:
he_il: פרופיל גוגל+:

source: My recent posts:
he_il: המאמרים האחרונים שלי:

source: Servula's Blog
he_il: הבלוג של Servula

source: Order Now
he_il: הזמן כעת

source: Download your eBook now!
he_il: הורד את הספר האלקטרוני כעת!

source: Full name
he_il: שם מלא

source: PDF file (%s size)
he_il: קובץ PDF (בגודל %s)

source: Download
he_il: הורד

source: Recent Posts about "%s"
he_il: פוסטים אחרונים בקטגוריית "%s"

source: Sorry but the page you are looking for cannot be found.
he_il: אנו מצטערים, אבל העמוד שחיפשת לא נמצא.

source: If you're in denial and think this is a conspiracy that cannot possibly be true, please try using my search box below.
he_il: אם אתה חושב שזאת טעות, אתה מוזמן להשתמש בתיבת החיפוש למטה.

source: posts archive
he_il: ארכיון פוסטים

source: You may also want to try looking through the %s, as you may just find something else to read instead.
he_il: אתה גם מוזמן לעיין ב%s, אולי תמצא משהו אחר שיעניין אותך.

source: Stop searching for freelancers, just tell us what you need.
he_il: תפסיק לחפש פרילנסרים, רק תגיד לנו מה אתה צריך.

source: We will find the right freelancer and check the quality of the work when it is completed
he_il: אנחנו נמצא את הפרילנסר המתאים למשימה, ונבדוק את איכות העבודה כשתסתיים לפני שנשלח אליך

source: <strong>450+</strong> Professionals are waiting your instructions
he_il: <strong>450+</strong> אנשי מקצוע מחכים להוראות שלך

source: I need the following service:
he_il: אני צריך את השירות הבא:

source: Content
he_il: תוכן

source: Article Writing
he_il: כתיבת תוכן

source: More Info
he_il: הסבר ודוגמאות

source: Copywriting
he_il: קופירייטינג

source: Press Release Writing
he_il: כתיבת הודעה לעיתונות

source: Translation
he_il: תרגום

source: Article Submission
he_il: הפצת מאמרים

source: Directory Submission
he_il: הוספה לאינדקסים

source: Local Listing
he_il: קידום ב-Google Local

source: Answers Posting
he_il: שאלות ותשובות

source: Social
he_il: חברתי

source: Social Bookmarking
he_il: סימניות חברתיות

source: Blog Building
he_il: בניית בלוג

source: Other
he_il: שונות

source: Dedicated Freelancer
he_il: פרילנסר ייעודי

source: Usability Test
he_il: בדיקת שמישות

source: Servula is trusted by...
he_il: לקוחות אומרים עלינו ש..

source: Recent Posts From our Blog
he_il: פוסטים אחרונים מהבלוג

source: All Posts &raquo;
he_il: כל הפוסטים &raquo;

source: If you're interested in getting high quality Inbound Marketing Services, you can start using Servula now
he_il: זה יותר פשוט ממה שתיארת לעצמך! כדאי לנסות כבר היום את שירותי הקידום שלנו

source: Get Started Now
he_il: התחל כעת

source: Download eBook title
he_il: הורד ספר אלקטרוני

source: PDF size
he_il: גודל PDF
